app/views/posts/_comment.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 5]]
---
<% @post.post_comments.each do |post_comment| %>

INSERT INTO "post_comments" ("comment", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "sdad"], ["user_id", 1], ["post_id", 5], ["created_at", "2021-06-08 10:38:49.938807"], ["updated_at", "2021-06-08 10:38:49.938807"]]
---
    <div class="comment-day">
        <%= post_comment.created_at.strftime('%Y/%m/%d') %>