app/views/posts/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]
---

  <p>コメント件数: <%= @post.post_comments.count %></p>