app/views/posts/top.html.erb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]
---
  <p>ユーザーネーム：<%= post.user.name %></p>
  <p><%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %></p>