app/controllers/messages_controller.rb

  def create
    if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
      @message = Message.new(message_params)
      @message.save!
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 1], ["room_id", 4]]
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 4], ["content", "fdgfdgfdg"], ["created_at", "2021-06-06 12:13:01.066416"], ["updated_at", "2021-06-06 12:13:01.066416"]]