app/controllers/posts_controller.rb

    def create
      @post = Post.new(post_params)
      @post.user_id = current_user.id
      if @post.save
---
INSERT INTO "posts" ("image_id", "user_id", "post_bike", "title", "post_profile", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def index
      # gem ransackによる検索機能
      @q = Post.ransack(params[:q])
      # 検索結果の新しい順
      @q.sorts = 'updated_at desc' if @q.sorts.empty?
      # tag付け
      @posts = Post.tagged_with(params[:tag_name]).page(params[:page]) if params[:tag_name]
      if @posts == nil
        # ransackとページネーションの使用
        @posts = @q.result.includes(:user).page(params[:page])
---
SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" INNER JOIN "taggings" "post_taggings_f52f76e" ON "post_taggings_f52f76e"."taggable_id" = "posts"."id" AND "post_taggings_f52f76e"."taggable_type" = 'Post' AND "post_taggings_f52f76e"."tag_id" IN (SELECT "tags"."id" FROM "tags" WHERE LOWER("tags"."name") LIKE '#www#wwwwwww' ESCAPE '!')
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('新しいバイク') OR LOWER(name) = LOWER('cbr') OR LOWER(name) = LOWER('自慢'))
SELECT  DISTINCT "posts".* FROM "posts" LIMIT ?  [["LIMIT", 11]]

    def show
      @post = Post.find(params[:id])
      @post_comment = PostComment.new
      @post_comments = @post.post_comments.order(id: 'desc').page(params[:page]).per(5)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 8]]

    def edit
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (?, ?, ?)  [["id", 3], ["id", 5], ["id", 6]]

    def update
      @post = Post.find(params[:id])
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "image_id" = ?, "post_bike" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_id", "68001a47515d9b19c88f61c8598b72d81af8887ddb9e52a2c989485951a1"], ["post_bike", "GSR25033"], ["updated_at", "2021-06-04 09:37:47.656153"], ["id", 2]]