app/controllers/post_comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @post_comment = PostComment.new(post_comment_params)
    @post_comment.post_id = @post.id
    @post_comment.user_id = current_user.id
    @post_comment.save
    @post_comments = @post.post_comments.order(id: 'desc').page(params[:page]).per(3)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 2], ["post_id", 6], ["created_at", "2021-06-08 04:03:54.471568"], ["updated_at", "2021-06-08 04:03:54.471568"]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 5]]

  def destroy
    @post = Post.find(params[:post_id])
    post_comment = @post.post_comments.find(params[:id])
    post_comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? AND "post_comments"."id" = ? LIMIT ?  [["post_id", 5], ["id", 43], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 43]]