app/controllers/posts_controller.rb

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy

UPDATE "posts" SET "image_id" = ?, "post_bike" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_id", "68001a47515d9b19c88f61c8598b72d81af8887ddb9e52a2c989485951a1"], ["post_bike", "GSR25033"], ["updated_at", "2021-06-04 09:37:47.656153"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)