app/controllers/rooms_controller.rb

  def create
    @room = Room.create
    @entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))
---
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-06-06 12:11:10.121482"], ["updated_at", "2021-06-06 12:11:10.121482"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 4], ["created_at", "2021-06-06 12:12:48.549689"], ["updated_at", "2021-06-06 12:12:48.549689"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 4], ["created_at", "2021-06-06 12:12:48.567831"], ["updated_at", "2021-06-06 12:12:48.567831"]]

  def show
    @room = Room.find(params[:id])
    if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 1], ["room_id", 4]]