app/controllers/rooms_controller.rb

    def show
      @room = Room.find(params[:id])
      # entryテーブルに情報があるか確認
      if Entry.where(user_id: current_user.id, room_id: @room.id).present?
        # メッセージを上から新しい順に表示
         @messages = @room.messages.order(id: 'desc').limit(7)
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 4]]