app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]
---
    def show
      # ransackによる検索
      @q = Post.ransack(params[:q])
      # 検索結果を新しい順
      @q.sorts = 'updated_at desc' if @q.sorts.empty?
      # ページネーション
      @posts = @q.result.includes(:user).page(params[:page])
      @user = User.find(params[:id])
      # 新しい順にそのユーザーが投稿したものを表示
      @posts = @user.posts.order(id: 'desc')

      # ユーザーがすでにルームに参加しているか判断
      @currentUserEntry = Entry.where(user_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "gender" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["gender", 0], ["profile", ""], ["updated_at", "2021-06-04 08:31:04.970335"], ["id", 1]]
---
    def update
      @user = User.find(params[:id])
      @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def unsubscribe
      @user = User.find(params[:id])